In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    733     59   John  January      Q1
1  2023-01-02       B   West    783     99   Mary  January      Q1
2  2023-01-03       C  North    337     20    Bob  January      Q1
3  2023-01-04       D  South    454     43  Alice  January      Q1
4  2023-01-05       A   East    226     12   John  January      Q1
5  2023-01-06       B   West    992     31   Mary  January      Q1
6  2023-01-07       C  North    894     16    Bob  January      Q1
7  2023-01-08       D  South    487     39  Alice  January      Q1
8  2023-01-09       A   East    741     30   John  January      Q1
9  2023-01-10       B   West    496     40   Mary  January      Q1
10 2023-01-11       C  North    659     77    Bob  January      Q1
11 2023-01-12       D  South    831     68  Alice  January      Q1
12 2023-01-13       A   East    156     93   John  January      Q1
13 2023-01-14       B   West    730     49   Mary  January      Q1
14 2023-01-15       C  North    290     40    Bob  January      Q1
15 2023-01-16       D  South    807     14  Alice  January      Q1
16 2023-01-17       A   East    983     44   John  January      Q1
17 2023-01-18       B   West    462     43   Mary  January      Q1
18 2023-01-19       C  North    336     53    Bob  January      Q1
19 2023-01-20       D  South    154     19  Alice  January      Q1

In [4]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product', aggfunc='median')

Product      A      B      C      D
Region
East     733.0    NaN    NaN    NaN
North      NaN    NaN  337.0    NaN
South      NaN    NaN    NaN  487.0
West       NaN  730.0    NaN    NaN

In [5]:
pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product', aggfunc='median')

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     733.0    NaN    NaN    NaN  44.0   NaN   NaN   NaN
North      NaN    NaN  337.0    NaN   NaN   NaN  40.0   NaN
South      NaN    NaN    NaN  487.0   NaN   NaN   NaN  39.0
West       NaN  730.0    NaN    NaN   NaN  43.0   NaN   NaN

### Cross Tabs

In [6]:
pd.crosstab(df['Region'], df['Product']) # cross tab is used for counting

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0